---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.NoFlatCurtainRoofs
source: html/e402ca4f-d3c9-dbca-5cf7-c85d12ab6061.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.NoFlatCurtainRoofs Property

A Sloped Glazing with no slope is not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoFlatCurtainRoofs { get; }
```